# 8) რა არის key
# key არის თვითონ dictionary - ის ერთ ერთი ნაწილი რომელსაც ეძლევა სახელი


# 9) რა არის value
# value არის key - ის დახასიათება მაგ     key = city ,
#                                        value = Tbilisi


# 10) რა განსხვავებაა dictionary-ს და list-ს შორის
# განსხვავებაა რომ  dictionary ვიყენებთ მონაცემების დაწყვილებასთან ანუ მაგ ქალაქი = თბილის , სახელი = თემო 
# ანუ მონაცემებს ვახასიათებთ ხოლო list ვიყენებთ რომ ჩვენ ვქონდე ელემენტებეი დალაგებული თუნდა მეორდებოდეს ასვე შეგვიძლია გამოვიძახოთ მონაცემები
# ინდექსით ხოლო dictionary კი key ვიძახებთ.


# 11) რა განსხვავებაა dictionary-ს და set-ს შორის
# განსხვავებაა რომ set - ვიყენებთ რომ მონაცემები ვქონდეს რომლებიც არ მეორდება და dictionary უბრალოდ ორი მონაცემია 
# პირველი  - მონაცემის სახელი მეორე მისი დახასიათება.