// 3) შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს პროდუქტის საწყის ფასს.//
// პირველი prompt()-ით მოითხოვეთ ნივთის ფასი.//
// მეორე prompt()-ით მოითხოვეთ ფასდაკლების პროცენტი (მაგალითად: 20).//
// პროგრამამ უნდა გამოთვალოს საბოლოო ფასი ფორმულით: $ფასი - (ფასი \times პროცენტი / 100)$.//
// alert()-ით გამოიტანეთ შეტყობინება: "თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: [შედეგი] ლარი".//

let price = prompt("Enter product price:")
let Discount = prompt("Enter Discount %:")
let result = Number(price) - (Number(price) * Number(Discount)) / 100
alert(`თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: ${result} ლარი`)