// 4)რა განსხვავებაა prompt ცნებასა და alert ცნებას შორის განმარტეთ თეორიულად რაც მთავარია გაიაზრეთ

// prompt არის ორმხრივი და alert არის ცალმხრივი, prompt - მეშვეობით ჩვენ მომხმარებელს ვეკითხებით რაღაც ინფორმაციას
// და გვაქვს ორი ღილაკი ok და cancel ასევე იგი ჭებულობს string. alert - მეშვეობით ჩვენ შეგვიძლია გამოვიტანოთ საიტზე რაღაც გაფრთხილება ანუ
// რაღაც ტექსტი და მას მარტო ok ღილაკი აქვს.

// 5)შეგვიძლია თუ არა alert  და prompt-ის გაერთიანება თუ კი მომიყვანეთ მაგალითი, თუ არა რატომ? წარმატებები//
// კი გაერთიანბეა შეგვიძლია//

let name = prompt("Enter your name:");
alert(`მოგესალმებით ${name}`)