# 1) ჩამოთვლაეთ tuple-ის მეთოდები და ახსენით რა რას აკეთებს

#tuple მეთოდები არის index და count. index დროს ჩვენ უნდა მივუთითოთ ელემენტი და გამოიტანს რომელ ინდექსზეა იგი.
# count - კიდევ უნდა მივუთითოთ ელემენტი და გამოიტანს თუ რამდენჯერ მეორდება ეს ელემენტი.

# 2) ჩამოთვლაეთ list-ის მეთოდები და ახსენით რა რას აკეთებს

#list- მეთოდენი არი append,remove,pop,len,insert,reverse,index,count,sort
# append - ამატებს ელემენტს ბოლოში
# remove - აშორებს ელმენტს თვითონ ელმენტის სახელით
# pop - შლის ელემენტს ინდექსით
# insert - ამატებს ელმენტს ოღონდ შეგვიძლია მივუთითოთ რომელ ინდექსზე დაამატებს იგი
# reverse - აბრუნებს სიას
# count - ითვლის ელემეტნს
# sort - ალაგებს სიას ზრდადობის მიხედვით და ცვლის თავდაპირველ სიას.

# 3) ჩამოთვლაეთ dictionary-ის მეთოდები და ახსენით რა რას აკეთებს

# get -შეგვიძლია გამოივიძახოთ რაიმე ელემეტნი
# values - გამოიტანს მხოლოდ value
# key - გამოიტანს ყველა key
# clear - ასუფთავებს dictionary 
# del შლის key და values

# 4) ჩამოთვლაეთ set-ის მეთოდები და ახსენით რა რას აკეთებს

# remove - აშორებს ელემენტს ოღონდ თუ მივუთითებთ არასწორს ელემენტს ამოაგდებს ერორს
# discard -იგივე ნაირად აშორებს ოღონდ უკვე ერორს არ ამოაგდებს 
# add - ამატებს set ელემენტს ოღონდ 1 ელემენტს
# update - ამატებს უამრავ ელემეტნს set-ში 
# union - აერთიანებს ორ სეტს ერთში 

# 5) დაასახელეთ თქვენთვის ნაცნობი მონაცემთა ტიპები

# string,integer,float,boolean

# 6) რა განსხვავებაა მონაცემთა სტრქუტურასა და მონაცემთა ტიპებს შორის

# განსხვავება ისაა რომ მონაცემთა ტიპი თვითონ ელემენტია რაღაც მონაცემი და მონაცემთა სტრუქტურა შეიცავს სხვადასხვა მონაცემთა ტიპებს.