// 1) ახსენი რას შვება  round,floor,ceil,trunc,pow,sqrt,min,max
// round - დამრგვალება
// floor - დამრგვალება მცირე მხარეს
// ceil - დამრგვალება უდიდეს მხარეს
// trunc - შლის რიცცხვებს წერტილის შემდეგ რაც არის
// pow - ხარისხში აყვანა
// sqrt - კვადრატი ამოყავს ფესვიდან
// min - უმცირეს გაიგებს
// max - უდიდეს გაიგებს

// 2) გაქვთ მოცემული მასივი [1,2,3,5.5,6.2,10.1,7] და დაითვალეთ მათი ჯამი და დაამრგვალეთ round.

let nums = [1,2,3,5.5,6.2,10.1,7];
let sum = 0;
for (i of nums){
    sum += i
}

console.log(Math.round(sum))