name="goa oriented academy"

#1თქვენი დავალებაა შექმნათ ცვლადი და შეინახოთ მასში სტრინგის მონაცემთა ტიპის ინფორმაცია და შემდგომ გამოიტანოთ შედეგად

print(name)

number=10

print(number)


#2 შექმენით ცვლადები სადაც შეინახავთ თქვენი მშობლების ან ოჯახის წევრების სახელებს, საბოლოოდ კი ისინი სათითაოდ გამოიტანეთ

name="შაკა" 

print(name)

name="თეა"

print(name)



#3 შექმენით 2 ცვლადი, ერთში დაწერთ თვქენ სახელს, მეორეში კი თვქენ ასაკს, საბოლოოდ კი ორივე დაპრინტეთ და გამოიტანეთ

name="თემო არის"

number="15" 

print(name)

print(number)




