# 1) რამდენი მონაცემთა სტრუქტურაა პითონში?

# 4 მონაცემთა სტრუქტურა გვაქვს list,set,dictionary,tuple

# 2) რა განსხვავებაა მათ შორის? (ყველას შორის)

# list -არის სია სადაც შეგვიძლია ყველანაირად მასზე მუშაობდა და მისი შეცვლა.
# set - არის მონაცემთა სტუქტურა სადაც უნიკალურობა არის ის რომ მას არ აქვს დუბლიკატი ელემენტები და იგი 
# არის დაულაგებელი და ინდექსაცია არ აქვს.
# dictionary -არის ლექსიკონი სადაც ორი მონაცემი გვაქვს key და value სადაც ჩვენ მონაცემის დახასიათება 
# და key არ შეიძლება განმეორდეს 2 ჯერ ან მეტჯერ.
# tuple -არის კორტეჟი სადაც მისი შეცვლა შეუძლებელია


# 3) რა არის საკვანძო სიტყვა
#საკვანძო სიტყვები def,if,elif,else,while ანუ სადაც რაღაც მოქმედებას ვიწყებთ და ამ საკვანძო სიტყვაში არის რაღაც ფუნქცია
# რომელსაც იგი ასრულებს.