#1) Ახსენით რა არის პირობითი ოპერატორები 

#პირობითი ოპერაოტი არის მაგ if else რომლებიც აძლევ რაღაცა პრიობას რომლის მიხედვით უნდა შესრულდეს მოქმედება და დაკმაყოფილდეს იგი.

#2) Ახსენით რა არის ლოგიკური ოპერატორები 

#ლოგიკური ოპერატორები არიან and or რომლებიც პრიობას აძლევენ რომელი უნა შესრულდეს როცა არის and ყველა პირობა უნდა შესრულდეს
#ხოლო or დროს 1 პირობაც რომ დაკმაყოფილდეს ისიც საკმარისია.


#3) მოცემულია რიცხვი num. შეამოწმე, არის თუ არა რიცხვი დადებითი და ლუწი. თუ ორივე პირობა შესრულდა,
#  დაბეჭდე "რიცხვი დადებითი და ლუწია", წინააღმდეგ შემთხვევაში —    "პირობა არ შესრულდა". 

number=int(input("Enter Number:"))

if number>0 and number % 2==0:
    print("რიცხვი დადებითი და ლუწია")
else:
    print("პირობა არ შესრულდა")




