/* 1) დაასახელეთ ყველა მონაცემთა ტიპი ჯავასკრიპტში 
1) string - ტექსტური მონაცემი "" 
2) number - რიცხვები ეს შეიძლება იყოს როგორც მთელი ასევე ათწილადი
3) boolean - true და false ოღონდ პატარა ასოებით იწერება პითონის გან განსხვავებით
4) undefined - აუღწერელი რომელსაც ცვლადის მერე არეფერი არ წერია და მას მნიშვნელობა არ აქვს
5) Null - ნული ანუ ცარიელი ცვლადი ოღონდ შეგვიძლია ის მერე შევცვალოთ

*/

/* 2) რა განსხვავებაა null-სა და undefined-ს შორის?
undefined არის აუღწერელი ცვლადი რომელსაც მნიშვნელობა არ აქვს ხოლო null არის ცარიელი მაგრამ შეგვიძლია მერე შევუცვალოთ მნიშვნელობა.
*/

/* 3) შექმენით ორი ცვლადი, ერთში მიუთითეთ თქვენი სახელი და მეორეში თქვენი ასაკი */

let name1 = "Temo";
let age = 15;

/* 4) იგივე ცვლადების გამოყენებით, შეცვალედ სახელის მნიშვნელობა და ასაკი */

name1 = "gio"
age = 20



/* 5) შექმენით ცვლადი, რომლის მნიშვნელობის შეცვლა უნდა იყოს "შეუძლებელი" */


const country = "Georgia";
