#1) თქვენი სიტყვებით ახსენით რა არის ცვლადი, რისთვის გამოიყენება
#ცვლადის საშუალებით ჩვენ შეგვძლია შევინახოთ რაიმე ინფორმცაია და გამოვიყენოთ იგი ცვლადი შეიძლება იყოს მაგ: name,number,age...
#ცვლადი ინახავს ინფორმაციას და მის საშუალებით შემდგომ შეგვიძლია შევასრულეთ რაიმე ქმედებები ცვლადის გარეშე ჩვენ ვერ გავაკეთებთ ლოგიკურ
#მოქმედებებს და გავიჭედებით.

#2) ახსენით რა არის მონაცემთა ტიპი, ასევე დაასახელეთ ყველა რაც გავიარეთ და ასევე ახსენით რომელი რა არის
#მონაცემთა ტიპი არის სადაც შედის რაიმე ინფორმაცია თუნდაც ტექსტი,რიცხვი გვაქვს 4 სახის მონაცემთა ტიპი 1- სტრინგი ჩაიწერება "" 
#სტრინგში შეგვიძლია ჩავწეროთ ნებისმიერი ინფორმაცია.    მეორე ტიპი არის ინტეჯერი ეს არის მთელი რიცხვები (მაგ:10,5,2...)
#ინტეჯერის დროს ჩვენ მოკლედ ვწერთ int  და მის საშუალებით შეგვიძლია ვიანგარიშოთ ლოგიკურად როცა სტრინგის დროს უბრალოდ მიეწერებოდა
#გვერდზე "5" + "5"=55 ხოლო ინტეჯერის დროს იგი მათემატიკურად გამოითვლის და დაწერს 5+5=10 floaat არის ათწილადებით (მაგ3,5,7,5) 
#boolean წარმოადგენ True და False

#3) ახსენით რა არის ტერმინალი
#ტერმინალი ეს არის ფანჯარა სადაც ვხედავთ თუ როგორ იმუშავა კოდმა და იქ გამოიტანს მას.

#4) ახსენით რას აკეთებს print() ფუნქცია, რატომ სჭირდება () რომ იმუშაოს
#print() ფუნქცია გამოიტანს ტერმინალში მაგ ინფორმაციას რასაც იქ ჩავწერთ მას () იმიტომ ჭირდება რომ მას დასაწყისივე მოყვება () მის გარეშე 
#ამოაგდებს errors და პრინტ ფუნქცია უბრალოდ არ იმუშავებს.

#5) ახსენით რას ნიშნავს სინტაქსი
# სინტაქსი არის წესი რის მიხედვითაც უნდა დაიწეროს კოდი ასევე სინტაქსი ცნობს არასწორდ დაწერილ კოდს რადგან
#  როცა კოდი არასწორია კომპიუტერი ვერ გადაიყვანს თავის ენაზეე

#6) რა არის კომენტარი, რას აკეთებს ის და რისთვის გამოიყენება
#კომენტარის საშუალებით ჩვენ შევიძლია ჩავინიშნით რაიმე ინფორმაცია მაგ: მაგ კოდში რა მოქმედებს ვასრულებთ ან კი რა არის ჩვენი მიზანი 

#7) ჩამოთვალეთ მაგალითები როგორ არ უნდა იწერებოდეს ცვლადის სახელი, რა შემთხვევაში იქნება არასწორი
#ცვლადის სახელი ჯერ ერთ უნდა დაიწეროს ლოგიკურად მაგალითად როცა გვინდა დავწეროთ სახელი ცვლადს უნდა დავრქვათ name რომ
#იყოს ლოგიკური ასევე ჩვენ არ შეგვიძლია ცვლადს დავარქვათ ასე: 11name რადგან დასაწყისში რიცხვის დაწერა არ შეიძლება და შეცდომას ამოაგდებს.

#8) რა ქვია იმ ფუნქციას რომელიც რიცხვს ან მთელ რიცხვს გადააქცევს სტრინგად?
#string--- str "" 

#9) როგორ იწერება სტრინგი, რომელი სამი ბრჭყალი არის დაშვებული
#str   " name "     'name'   """"name"""

#10) რომელი ორი boolean არსებობს პროგრამირებაში
#True   False  

#11) რა არის input() ფუნქცია, რას აკეთებს და რისთვის გამოიყენება?
#input ფუნქციის საშუალებით ჩენ შგვიძლია მოვსთხოვოთ მომხმარებელს რაიმე ინფორმაცია მაგ:name,,age,birth...  და ასევე იგი მაგ ინფორმაციას
#შეინახავს რადგან წინ ეწერება მას რაიმე ცვლადი.

#12) რა მონაცემთა ტიპად იღებს input() ფუნქცია, ნებისმიერს, გინდა იყოს რიცხვი ან ბულიანი
#იგი იღებს მას სტრინგად რადგან "" ვწერთ

#13) როგორ უნდა მოვახდინოთ მათემატიკური ოპერაცია input() ფუნქციის დახმარებით? (მომხმარებელს შემოვატანინოთ ორი რიცხვი)
# რომ მოხდეს მათემატიკური ოპერაცია ვაკეთებთ რაიმე ცვლადს და input ვუწერთ int რადგან მოხდეს მათემატიკური გამოთცვლები
#მაგ: number=int(input("enter number:"))

#14) რა არის low-level და high-level პროგრამირების ენები? რა განსხვავებაა მათ შორის
#low-level არის პროგრამირების ენა რომელიც მიახლოებულია კომპიუტერის ენასთან და ჩვენთვის მისი გაგება რთულია ხოლო high-level არის
#პროგრამირების ენა რომელიც ადამიანის ენასთან არის მიახლოებული და მისი გაგება ჩვენთვის ადვილია მაგ როგორიცაა python ხოლო ასევე
#low-level ენები ბევრად სწრაფია high-level-ზე რადგან კომპიტერს არ უწევს ინფორმცაიის გადამუშავება და high-level დროს მას უწევს
#ეს ინფორმაცია რამდენჯერმე გადაამუშავოს რომ თვითონ კომპიუტერმა იგი გაიგოს.

#15) რატომ არის low-level პროგრამირების ენები სწრაფი high-level პროგრამირების ენებზე?
#რადგან კომპიტერს არ უწევს ინფორმცაიის გადამუშავება და high-level დროს მას უწევს
#ეს ინფორმაცია რამდენჯერმე გადაამუშავოს რომ თვითონ კომპიუტერმა იგი გაიგოს.

#16) ახსენით რა არის პირობითი ოპერატორები
#პირობითი ოპერატორები არიან if და else მათ აქვთ რაღაც პირობა რომლის შედეგის მიხედვით შესრულდება შემდეგი მოქმედება if ნიშნავს (თუ)
#ანუ თუ 5>3 ხოლო else არის if საპირისპირო თუ if პირობა არ შესრულდება მაშინ შესრულდება else პირობა.

#17)  რა არის ლოგიკური ოპერატორები
#ლოგიკური ოპერატორები არის and (და) და or (ან) ისინი პირობას აძლევენ ასეთ ფუქნციას რომ and დროს ყველა პირობა უნდა შესრულდეს ხოლო
#or დროს რომელიმე ერთიც რომ დაკმაყოფილდეს ისიც საკმარისია რომ პირობა შესრულდეს.

#18) რა არის if-else statement? ზოგადად statement რას ნიშნავს
# statement არის პირობა ან მდგომარეობა რომლებიც if else აძლევენ პირობას რომ იგი იმოქმედოს if statement არის True ხოლო 
#else statement არის False

#19) რამდენი შემთხვევებია if-else statement-ში, როგორ მუშოაბს და რისთვის გამოიყენება
#if-else statement გამოიყენება რაიმე პირობა რომ შევქმნათ მაგ:

name=input("Enter your name:")
age=int(input("Enter your age:"))
print(name,age,"წლის")
if age>=18 :
    print("შენ ხარ სრულწლოვანი")
else:    
    print("შენ არ ხარ სრულწლოვანი")


































