# #გაიხსენეთ ნასწავლი ოთხივე მონაცემთა სტრუქტურა პითონში
# სათითაოდ ჩამოთვალეთ რომელს რა ახასიათებს
# რა განსხვავება არის მათ შორის
# თითოს რამდენი ფუნქციები გააჩნია და ჩამოთვალეთ ისინი

# 1) ჩვენ გვაქვს 4 მონაცემთა სტრუქტურა list,set,dictionary,tuple
#list არის სია რომელსაც ვიყენებთ როცა გვჭირდება სრული წვდომა ელემენეტებთად და შეგვიძლია წაშლა დამატება ინდექსით მუშაობა და ამიტომ ამ მხრიდან სია უფორ ხელმისაწვდომია.

#set არის მონაცემთა სტრუქტურა სად არ მეორდება ელემენტები რადგან როგორც კი შემაჩნევს რომ დუბლიკატი არის სეტში უბრალოდ ამოაგდებს და მასზე შეგვიძლია გამოვიყენოთ
# ასევე სეტს არ გააჩნია ინდექსაცია და იგი ყოველთვის დალუაგებლად ალაგებს სეტს რანდომად. მას აქვს ჩაშენებული ფუნქციები როგორიცაა remove,discard,add,update,union

#dictionary არის ლექსიკონი სადაც გვაქვს 2 ძირითადი მახასიათებელი key და value. key არის გასაღბი ანუ მონაცემის დასახელება ხოლო value არის თვითონ მონაცემი, მაგ
# city : tbilisi ასევე მას არ აქვს ინდექსი და უნდა გამოვიძახოთ key-ით ასევე მასაც აქვს ჩაშენებული ფუნქციები del,clear,pop,value
# key  : value

# tuple არის მონაცემთა სტრუქტურა რომელიც სრულიად უცვლელია მას იყენებან როცა საჭიროა შევინახოთ მონაცემები ოღონდ რ გვინდა რომე იგი შეიცვალოს, ასევე მას გააჩნია
# 2 ჩაშენებული ფუნქცია index,count.



# დაასახელეთ თქვენთვის ნაცნობი მონაცემთა ტიპები
# რა განსხვავებაა მონაცემთა სტრქუტურასა და მონაცემთა ტიპებს შორის

# 4 მონაცემთა სტრუქტურა გვაქვს string,integer,float,bool
# მონაცემთა სტრუქტურასა და მონაცემთა ტიპებს შორის განსხვავება ისაა რომ მონაცემთა სტრუქტურა მოიცავს ყველანარი მონაცემთა ტიპს როდესაც მონაცემთა ტიპი მარტო თავისი თავია.
