# 1) რა არის add() ჩაშენებული ფუნქცია?
# add() ჩაშენებული ფუნქცია არის ელემენტის დამატება სეტში ანუ 1 ელმენტს ამატებს სეტში მაგ: set1.add(1)


# 2) რა არის union() ჩაშენებული ფუნქცია?
# union() ჩაშენებული ფუნქცია აერთიენს 2 სეტს ერთში მაგ: result = set1.union(set2)


# 3) რა არის discard() ჩაშენებული ფუნქცია?
# discard() ჩაშენებული ფუნქცია აშორებს სეტიდან ელემნტს 


# 4) რა არის remove() ჩაშენებული ფუნქცია?
# remove() ჩაშენებული ფუნქცია იგივე ნაირად აშორებს ელემნტს სეტიდან და სიიდან


# 5) რა არის update() ჩაშენებული ფუნქცია?
# update() ჩაშენებული ფუნქცია სეტს ანახლებს და ამატებს რამდენიმე ელემენტს მაგ set1.update([1,2,3,4,5])  


# 6) რა განსხვავება არის discard() - სა და remove() ჩაშენებულ ფუნქციებს შორის?
# discard() და remove() განსხვავება არის რომ თუ remove() დროს მივუთითებთ ელემენტს რომელიც არ არის სეტში ამოაგდებს KeyErrors და discard()
# დროს უბრალოდ გაატარებს და დაბეჭდავს ჩვეულებრივად თავდაპირველ სეტს

# 7) დაამატეთ სეტში ერთი ელემენტი.

nums = set()
nums.add(1)
nums.update([1,2,3])
print(nums)