#6) ახსენით რა არის global და local scope-ები
#global scope არის ბრძანება ან ცვლადები რომლებიც განლაგებულია ფუნქციის გარეთ ანუ მთლიანად ფაილში და მისი გამოენება ყველგან შეგვიძლია
#local scope კი მხოლოდ ის ბრძანება და ცვლადებია რომელიც მხოლოდ ფუნქციაშია და მხოლოდ იქ მუშაობს.


#7)ახსენით რა არის def
#def არის საკვანძო სიტყვა რომლის საშუალებით ჩვენ ფუნქციას სახელს ვაძლევთ

#8)ახსენით რა ქვია იმ ნაწილს რომელიც ფუნქციის მერე მოდის
#პარამეტრი

#9)ახსენით რა არის პარამეტრი
#პარამეტრი არის რაიმე მნიშვნელობა რომელსაც ჩვენ არგუმენტში ჩავწერთ და არგუმენტის მნიშნველობას პარამეტრი ღებულობს


#10)შექმენით კალკულატორის ფუნქცია რომელიც შეკრიბას გამოაკლებს გაამრავლებს და გაყოფს 2 რიცხვს ერთმანეთზე და შემდეგ გამოიძახეთ ეს ფუნქცია


print("Calkulator------------------")
def Calculator(a,b):
    if a<=5 and a>0:
        print(a,"+",b,"=",a+b)
       
    elif a>5 and a<=10:
        print(a,"-",b,"=",a-b)
        
    elif a>10 and a<=15:
        print(a,"*",b,"=",a*b)
        
    elif a>15 and a<=20:
        print(a,"/",b,"=",a/b)
        
Calculator(5,2)














print("---------------------------")
print("C_____()_____%____/")
print("7_____8______9____X")
print("4_____5______6____-")
print("1_____2______3____+")
print("__________________=")









