#6) ახსენით რა არის global და local scope-ები
#global scope არის ბრძანება ან ცვლადები რომლებიც განლაგებულია ფუნქციის გარეთ ანუ მთლიანად ფაილში და მისი გამოენება ყველგან შეგვიძლია
#local scope კი მხოლოდ ის ბრძანება და ცვლადებია რომელიც მხოლოდ ფუნქციაშია და მხოლოდ იქ მუშაობს.


#7)ახსენით რა არის def
#def არის საკვანძო სიტყვა რომლის საშუალებით ჩვენ ფუნქციას სახელს ვაძლევთ

#8)ახსენით რა ქვია იმ ნაწილს რომელიც ფუნქციის მერე მოდის
#პარამეტრი

#9)ახსენით რა არის პარამეტრი
#პარამეტრი არის რაიმე მნიშვნელობა რომელსაც ჩვენ არგუმენტში ჩავწერთ და არგუმენტის მნიშნველობას პარამეტრი ღებულობს


#10)შექმენით კალკულატორის ფუნქცია რომელიც შეკრიბას გამოაკლებს გაამრავლებს და გაყოფს 2 რიცხვს ერთმანეთზე და შემდეგ გამოიძახეთ ეს ფუნქცია
x=int(input("enter number:"))
y=int(input("enter number:"))
print("Calkulator----------")
def Calculator(a,b):
  
        print(a,"+",b,"=",a+b)
       
   
        print(a,"-",b,"=",a-b)
        
   
        print(a,"*",b,"=",a*b)
        
   
        print(a,"/",b,"=",a/b)
        
Calculator(x,y)














print("--------------------")
print("C_____()_____%____/")
print("7_____8______9____X")
print("4_____5______6____-")
print("1_____2______3____+")
print("__________________=")















































