#1) კიდევ ერთხელ ახსენით რა არის მონაცემთა სტრუქტურა
#მონაცემთა სტრქუტურის საშუალებით ჩვენ შეგვიძლია ერთ ცვლადში სხვადსხვა მონაცემთა ტიპები ჩავსვათ.

#2) ახსენით რა არის სია
#სია არის რაიმე ინფორმაციის სტრუქტურა.

#3) რისთვის გამოიყენება
#გამოიყენება იმისთის რომ ერთ ცვლადში სხვადასხვა მონაცემთა ტიპი ჩავსვათ და ამით ჩვენთვის უფრო ადვილია და დროშიც ვიგებთ.

#4) როგორ იწერება სინტაქსურად (პითონში)
#მაგ: name=["name",7,10]


#5) შექმენით რაიმე სია
#6) დაპრინეთ ეს სია მთლიანად
#7) გამოიტანეთ მისი ყველა ინდექსი სათითაოდ (ხელით, პირველიც, მეორეც, მესამეც, მეოთხეც, რამხელაც თქვენი სიაა)
#8) გამოიტანეთ სიის ბოლო ინდექსი

cars_models=["bmw","mercedes","audi","toyota","buggati"]
print(cars_models[0:4])
print(cars_models[0])
print(cars_models[1])
print(cars_models[2])
print(cars_models[3])
print(cars_models[4])
print(cars_models[-1])


























































































